In [1]:
import pandas as pd
import numpy as np

In [2]:
index = pd.MultiIndex.from_product([[2013, 2014], [1, 2]],
                                   names = ['year', 'visit'])
columns = pd.MultiIndex.from_product([['Bob', 'Guido', 'Sue'], ['HR', 'Temp']],
                                     names = ['subject', 'type'])

data = np.round(np.random.rand(4, 6), 1)
data[:, ::2] *= 10
data += 37

health_data = pd.DataFrame(data, index = index, columns = columns)
health_data

subject      Bob       Guido         Sue
type          HR  Temp    HR  Temp    HR  Temp
year visit
2013 1      39.0  37.9  41.0  37.3  39.0  37.2
     2      44.0  37.4  42.0  37.5  42.0  37.4
2014 1      41.0  37.5  46.0  37.0  46.0  37.2
     2      44.0  37.2  41.0  37.9  47.0  37.5

In [18]:
health_data['Guido']['HR']

year  visit
2013  1        41.0
      2        42.0
2014  1        46.0
      2        41.0
Name: HR, dtype: float64

In [17]:
health_data['Guido', 'HR']

year  visit
2013  1        41.0
      2        42.0
2014  1        46.0
      2        41.0
Name: (Guido, HR), dtype: float64

In [10]:
health_data.loc[2013].loc[1]['Guido']['Temp']

37.3

In [19]:
health_data.iloc[:2, :2]

subject      Bob
type          HR  Temp
year visit
2013 1      39.0  37.9
     2      44.0  37.4

In [26]:
health_data.loc[:, ('Bob', 'HR')]

year  visit
2013  1        39.0
      2        44.0
2014  1        41.0
      2        44.0
Name: (Bob, HR), dtype: float64

In [27]:
idx = pd.IndexSlice
health_data.loc[idx[:, 1], idx[:, 'HR']]

subject      Bob Guido   Sue
type          HR    HR    HR
year visit
2013 1      39.0  41.0  39.0
2014 1      41.0  46.0  46.0

In [32]:
health_data

subject      Bob       Guido         Sue
type          HR  Temp    HR  Temp    HR  Temp
year visit
2013 1      39.0  37.9  41.0  37.3  39.0  37.2
     2      44.0  37.4  42.0  37.5  42.0  37.4
2014 1      41.0  37.5  46.0  37.0  46.0  37.2
     2      44.0  37.2  41.0  37.9  47.0  37.5

In [35]:
data_mean = health_data.mean(level = 'year')

In [36]:
data_mean

subject   Bob        Guido          Sue
type       HR   Temp    HR   Temp    HR   Temp
year
2013     41.5  37.65  41.5  37.40  40.5  37.30
2014     42.5  37.35  43.5  37.45  46.5  37.35

In [37]:
health_data.mean(level = 'visit')

subject   Bob       Guido          Sue
type       HR  Temp    HR   Temp    HR   Temp
visit
1        40.0  37.7  43.5  37.15  42.5  37.20
2        44.0  37.3  41.5  37.70  44.5  37.45

In [45]:
data_mean.mean(axis = 'columns', level = 'type')

type         HR       Temp
year
2013  41.166667  37.450000
2014  44.166667  37.383333